Управление_закупками/src/Enums/СтавкаНДС/СтавкаНДС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтавкаНДС</name>
  <enumValues>
    <name>НДС0</name>
  </enumValues>
  <enumValues>
    <name>НДС10</name>
  </enumValues>
  <enumValues>
    <name>НДС18</name>
  </enumValues>
  <enumValues>
    <name>НДС20</name>
  </enumValues>
  <enumValues>
    <name>НДС5</name>
  </enumValues>
</mdclass:Enum>

Управление_закупками/src/CommonModules/ДокументыКлиент/Module.bsl
#Область ПрограммныйИнтерфейс

Функция ПолучитьПорядковыйНомерНовогоЭлементаТабличнойЧасти(ДокументОбъект, ИмяТабличнойЧасти, ИмяРеквизитаПорядковыйНомер, НомерПервойЗаписи = 1) Экспорт        
	
	Если ДокументОбъект[ИмяТабличнойЧасти].Количество() = 0 Тогда        
		Возврат НомерПервойЗаписи;    
	КонецЕсли;
	
	МаксНомерСтроки = 0; 
	
	Для каждого СтрокаТЧ Из ДокументОбъект[ИмяТабличнойЧасти] Цикл            
		МаксНомерСтроки = Макс(МаксНомерСтроки, СтрокаТЧ[ИмяРеквизитаПорядковыйНомер]);        
	КонецЦикла;
	
	НомерСтроки = МаксНомерСтроки + 1;
	Если НомерСтроки = 1 Тогда 
		Возврат НомерПервойЗаписи;
	Иначе		
		Возврат НомерСтроки;
	КонецЕсли;
	
	
КонецФункции

Функция ЗаказПроведен(ВнутреннийЗаказ) Экспорт
	
	Возврат ДокументыВызовСерверв.ЗаказПроведен(ВнутреннийЗаказ); 
	
КонецФункции

Функция ЗаказОтправленВОМТС(ВнутреннийЗаказ) Экспорт
	
	Возврат ДокументыВызовСерверв.ЗаказОтправленВОМТС(ВнутреннийЗаказ); 
	
КонецФункции


Функция ПолучитьСтавкуНДС( ПеречислениеСтавкаНДС)  Экспорт

	Если Не ЗначениеЗаполнено(ПеречислениеСтавкаНДС) Или	
		ПеречислениеСтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкаНДС.НДС0") Тогда
		
		Возврат 0;  
		
	ИначеЕсли ПеречислениеСтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкаНДС.НДС5") Тогда
		
	Возврат 5;
		
	ИначеЕсли ПеречислениеСтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкаНДС.НДС10") Тогда
		
		Возврат 10;
		
	ИначеЕсли ПеречислениеСтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкаНДС.НДС18") Тогда
		
		Возврат 18;
		
	ИначеЕсли ПеречислениеСтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкаНДС.НДС20") Тогда
		
		Возврат 20;
		
	Иначе  
					
		Возврат Неопределено;     
		
	КонецЕсли;
	
КонецФункции

Процедура ПересчитатьСуммуНДС(ТекущиеДанные, СтавкаНДС, ЦенаВключаетНДС) Экспорт 

	СтавкаНДСЧисло = Неопределено;
	
	Если ТипЗнч(СтавкаНДС) = Тип("ПеречислениеСсылка.СтавкаНДС") Тогда   
		
		СтавкаНДСЧисло = ПолучитьСтавкуНДС(СтавкаНДС);   
		
	Иначе 
		
		СтавкаНДСЧисло = СтавкаНДС;
		
	КонецЕсли;
	
	Если ЦенаВключаетНДС Тогда

		ТекущиеДанные.СуммаНДС = СтавкаНДСЧисло * ТекущиеДанные.Количество * ТекущиеДанные.Цена / (100 + СтавкаНДСЧисло);	
		
	Иначе
		
		ТекущиеДанные.СуммаНДС = СтавкаНДСЧисло * ТекущиеДанные.Количество * ТекущиеДанные.Цена / 100;
		
	КонецЕсли;
	
	
КонецПроцедуры

Процедура ПересчитатьСуммуТовараСНДС(ТекущиеДанные, СтавкаНДС, ЦенаВключаетНДС) Экспорт  
	
	СтавкаНДСЧисло = Неопределено;
	
	Если ТипЗнч(СтавкаНДС) = Тип("ПеречислениеСсылка.СтавкаНДС") Тогда     
		
		СтавкаНДСЧисло = ПолучитьСтавкуНДС(СтавкаНДС);   
		
	Иначе
		
		СтавкаНДСЧисло = СтавкаНДС;
		
	КонецЕсли; 
	
	Если ЦенаВключаетНДС Тогда

		ТекущиеДанные.СуммаСНДС = ТекущиеДанные.Количество * ТекущиеДанные.Цена;	
		
	Иначе
		
		ТекущиеДанные.СуммаСНДС = ТекущиеДанные.Количество * (100 + СтавкаНДСЧисло) * ТекущиеДанные.Цена / 100;
		
	КонецЕсли;
	
КонецПроцедуры      

Процедура ПересчитатьЦенуТовараОтносительноСуммыНДС(ТекущиеДанные, СтавкаНДС, ЦенаВключаетНДС) Экспорт  
	
	СтавкаНДСЧисло = Неопределено;
	
	Если ТипЗнч(СтавкаНДС) = Тип("ПеречислениеСсылка.СтавкаНДС") Тогда     		
		СтавкаНДСЧисло = ПолучитьСтавкуНДС(СтавкаНДС);   		
	Иначе		
		СтавкаНДСЧисло = СтавкаНДС;		
	КонецЕсли; 
	
	Если ТекущиеДанные.Количество = 0 ИЛИ СтавкаНДСЧисло = 0 Тогда
		
		ТекущиеДанные.СуммаНДС  = 0; 
		Возврат;
		
	КонецЕсли;
	
	Если ЦенаВключаетНДС Тогда

		ТекущиеДанные.Цена = ТекущиеДанные.СуммаНДС * (100 + СтавкаНДСЧисло) /(СтавкаНДСЧисло * ТекущиеДанные.Количество);
		
	Иначе
		
		ТекущиеДанные.Цена = ТекущиеДанные.СуммаНДС * 100 /(СтавкаНДСЧисло * ТекущиеДанные.Количество);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПересчитатьЦенуТовараОтносительноСуммыТовараСНДС(ТекущиеДанные, СтавкаНДС, ЦенаВключаетНДС) Экспорт  
	
	СтавкаНДСЧисло = Неопределено;
	
	Если ТипЗнч(СтавкаНДС) = Тип("ПеречислениеСсылка.СтавкаНДС") Тогда     		
		СтавкаНДСЧисло = ПолучитьСтавкуНДС(СтавкаНДС);   		
	Иначе		
		СтавкаНДСЧисло = СтавкаНДС;		
	КонецЕсли; 
	
	Если ТекущиеДанные.Количество = 0 Тогда
		
		ТекущиеДанные.СуммаСНДС  = 0; 
		Возврат;
		
	КонецЕсли;
	
	Если ЦенаВключаетНДС Тогда

		ТекущиеДанные.Цена = ТекущиеДанные.СуммаСНДС /ТекущиеДанные.Количество;
		
	Иначе
		
		ТекущиеДанные.Цена = ТекущиеДанные.СуммаСНДС * 100 /((СтавкаНДСЧисло + 100) * ТекущиеДанные.Количество);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьТабличнуюЧастьТовары(ТаблицаТовары,СтавкаНДС, ЦенаВключаетНДС) Экспорт

	Для Каждого ТекущиеДанные Из ТаблицаТовары Цикл  
		
		ДокументыКлиент.ПересчитатьСуммуНДС( ТекущиеДанные, СтавкаНДС, ЦенаВключаетНДС); 
		ДокументыКлиент.ПересчитатьСуммуТовараСНДС(ТекущиеДанные, СтавкаНДС, ЦенаВключаетНДС);
			
	КонецЦикла;
		
КонецПроцедуры


#КонецОбласти
